# -*- coding: utf-8 -*-

from django.core.management.base import NoArgsCommand
import datetime

from complaint.models import Complaints

#######################################################################################################################
#######################################################################################################################
#Менеджер помещает старые вакансии и резюме в архив и обновляет категории
class Command(NoArgsCommand):
	help = "Deleting complaints older than a week"

	def handle_noargs(self, **options):		
		Complaints.old_complaints.all().delete()				
		
		return

#######################################################################################################################
#######################################################################################################################