# -*- coding: utf-8 -*-

################################################################################################################
################################################################################################################

#График работы
SCHEDULE_CHOICE = [
	( 1, [u'полный рабочий день', u'Полный рабочий день', u'Полный день'] ), #полный рабочий день
	( 5, [u'свободный график', u'Свободный график'] ), #свободный график
	( 4, [u'Сменный график', u'Сменный график'] ), #сменный график
	( 3, [u'удаленная работа', u'Удалённая работа'] ), #удаленная работа
]

################################################################################################################
################################################################################################################

#Тип занятости
TYPE_EMPLOYMENT_CHOICE = [
	( 1, [u'Полный рабочий день', u'полная занятость', u'Полный день'] ), #полная занятость
	( 3, [u'Вечерняя', u'Не полный рабочий день', u'Ночная', u'Смешанная работа', u'Неполная занятость', u'частичная занятость', u'Неполный день'] ), #частичная занятость
	( 8, [u'Вахта'] ), #вахтовая работа
	( 6, [u'волонтерство'] ), #волонтерство
	( 5, [u'временная работа'] ), #временная работа
	( 7, [u'Разовая работа', u'проектная', u'Внештатный работник (Freelance)'] ), #проектная
	( 4, [u'стажировка'] ), #стажировка
]

################################################################################################################
################################################################################################################

#Тип ЗП
TYPE_WAGES_CHOICE = [
	( 1, [u''] ), #рублей
	( 5, [u''] ), #рублей в час
	( 6, [u''] ), #рублей за смену
]

################################################################################################################
################################################################################################################

#Образование
EDUCATION_CHOICE = [
	( 4, [u'Неполное среднее'] ), #неполное среднее
	( 2, [u'Средняя школа', u'Среднее'] ), #среднее
	( 3, [u'Ср. специальное', u'Ср. техническое', u'Среднеспециальное', u'Средне-специальное'] ), #средне-специальное
	( 5, [u'Неполное высшее'] ), #неполное высшее
	( 1, [u'Высшее'] ), #высшее
	( 6, [u'два и более высших'] ), #два и более высших
	( 7, [u'cтудент очник'] ), #cтудент очник
	( 8, [u'cтудент заочник'] ), #cтудент заочник
]

################################################################################################################
################################################################################################################

#Стаж
EXPERIENCE_CHOICE = [
	( 1, [u'Без опыта работы', u'до 1 года', u'без опыта', u'Без опыта'] ), #до 1 года
	( 2, [u'От года', u'1 год', u'2 года', u'1-3 года'] ), #1-3 года
	( 3, [u'От 3-х лет', u'3 года', u'3-5 лет'] ), #3-5 лет
	( 4, [u'Более 5 лет', u'5 лет'] ), #более 5 лет
	( 5, [u'Не важно'] ), #не важно
]

################################################################################################################
################################################################################################################

#Категории
CATEGORY_CHOICE = [
	( 4, [u'Бухгалтерия, Аудит', u'Финансы, Банковское дело', u'Банк, финансы, бухгалтерия', u'Банки, инвестиции', u'Бухгалтерия, финансы'], [u'бухгалт', u'банк', u'финанс'] ), #Бухгалтерия, финансы, банки
	( 5, [u'Управление персоналом', u'Административная работа', u'Высший менеджмент', u'Высший менеджмент'], [u'менедж'] ), #Высший менеджмент
	( 6, [u''], [] ), #Государственные службы, НКО
	( 7, [u'Дизайн, креатив'], [u'дизайн', u'художн'] ), #Дизайн, творческие профессии
	( 8, [u''], [] ), #Инсталляция и сервис
	( 9, [u'ИТ и Интернет', u'ИТ, Компьютеры, Интернет', u'IT, интернет, телеком'], [u'IT', u'ИТ', u'интернет', u'комп', u'програм'] ), #ИТ и Интернет
	( 10, [u'Кадровые службы'], [u'кадр', u'охрана труд'] ), #Кадровые службы, HR, охрана труда
	( 11, [u'Логистика, склад', u'Логистика, Склады, ВЭД', u'Закупки, Снабжение', u'Транспорт, логистика'], [u'логист', u'склад', u'закуп', u'снабж'] ), #Логистика, склад, закупки
	( 12, [u'Маркетинг и реклама', u'Маркетинг, Реклама, PR', u'Маркетинг, реклама, PR', u'Реклама и PR', u'Маркетинг'], [u'маркет', u'реклам', u'PR'] ), #Маркетинг, реклама, PR
	( 13, [u'Медицина и фармация', u'Медицина, Фармация', u'Медицина, фармацевтика'], [u'медиц', u'фармац'] ), #Медицина и фармация
	( 14, [u'Недвижимость'], [u'недвиж'] ), #Недвижимость
	( 15, [u'Образование, наука, культура', u'Образование, Наука, Иностранные языки', u'Образование, наука', u'Образование и воспитание'], [u'образован', u'наука', u'научн', u'культур', u'язык'] ), #Образование, наука, языки
	( 16, [u'Охрана, Службы безопасности', u'Охрана'], [u'охрана', u'безопасн'] ), #Охрана, безопасность
	( 17, [u'Работа дома'], [] ), #Персонал для дома
	( 18, [u'Офисный персонал', u'Персонал офиса'], [u'персонал', u'офис'] ), #Персонал офиса, АХО
	( 19, [u'СМИ, издательство, полиграфия', u'СМИ, Издательство, Полиграфия'], [u'СМИ', u'издатель', u'полиграф'] ), #Полиграфия, издательства, СМИ
	( 20, [u''], [] ), #Продажа услуг
	( 21, [u'Промышленное производство', u'Производство, сырьё, с/х', u'Производство и промышленность'], [u'промышлен', u'производств'] ), #Промышленность непищевая
	( 22, [u''], [u'пищев'] ), #Промышленность пищевая
	( 23, [u'Работа для студентов / Без спец. подготовки', u'Без опыта, студенты'], [u'студент'] ), #Работа для студентов
	( 24, [u'Рабочие профессии'], [u'рабоч'] ), #Рабочий персонал
	( 25, [u'Общественное питание', u'Рестораны, Кафе, Столовые'], [u'питание', u'ресторан', u'кафе', u'столов', u'общепит'] ), #Рестораны, кафе, общепит
	( 26, [u'Производство, сырьё, с/х', u'Производство и эксплуатация'], [u'сельск'] ), #Сельское хозяйство
	( 27, [u'Индустрия красоты', u'Фитнес, салоны красоты'], [u'спорт', u'красот', u'здоров'] ), #Спорт, красота, здоровье
	( 28, [u'Страхование'], [u'страх'] ), #Страхование
	( 29, [u'Строительство и ремонт', u'Строительство, Ремонт, Интерьер', u'Строительство', u'Строительство и архитектура'], [u'строит', u'ремонт', u'архитект', u'интерьер'] ), #Строительство, архитектура
	( 30, [u'Бытовые и коммунальные услуги', u'Сфера услуг, Сервис', u'Консультирование', u'Сфера обслуживания'], [u'услуг'] ), #Сфера услуг
	( 31, [u'Телекоммуникация и связь', u'Телекоммуникации и связь', u'Коммуникации'], [u'связь', u'телеком'] ), #Телекоммуникации и связь
	( 32, [u'Оптовая торговля', u'Продажи', u'Торговля оптовая, Торговля розничная', u'Торговля склад'], [u'оптов'] ), #Торговля оптовая, сбыт
	( 33, [u'Розничная торговля', u'Продажи'], [u'торг', u'розничн'] ), #Торговля розничная
	( 34, [u'Транспорт, автобизнес', u'Транспорт, Автобизнес', u'Автомобильный бизнес', u'Транспорт экспедиция автобизнес'], [u'транспорт', u'авто'] ), #Транспорт, автобизнес
	( 35, [u'Туризм'], [u'туризм', u'гостин'] ), #Туризм, гостиничное дело
	( 36, [u'Производство, сырьё, с/х', u'Производство и промышленность'], [u'энерг', u'сырь'] ), #ТЭК, энергетика, добыча сырья
	( 37, [u'Юриспруденция'], [u'юрисп', u'юрист'] ), #Юриспруденция
	( 38, [], [] ), #Прочее
]

################################################################################################################
################################################################################################################
